test/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         leastSquares; //Gauss linear; //Gauss linear is widely used
								    // leastSquares is employed sometimes in FvLBM
}

divSchemes
{
    default        	Gauss linear;
    //div(xi,"f.+")   Gauss linear; //bounded Gauss upwind; // Gauss linearUpwind grad(f); // This was found in scalarTransportFoam
											// however there are a variety of bounded methods recomended for transport
}

laplacianSchemes
{
	default			none;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //

/* REF: https://doc.cfd.direct/openfoam/user-guide-v7/fvschemes */
