test/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expresions
{
  U
  {
    field       U;
    dimensions  [0 1 -1 0 0 0 0]

    constants
    {
      bkg       (1 0 0);
    };

    variables
    {
      "lenght = 6"
      "UMAX   = 1"
    }

    condition
    #{
        mag(pos().x()) < lenght
    #};

    expression
    #{
        uniform (1 0 0)
    #};

  }
}


// ************************************************************************* //
